In [1]:
data = {
    '이름': ['채치수','정대만','신호철','송진영','김태권','김현지','이상은','강백호'],
    '학교':['북산고','북산고','시사고','쿠팡고','서울고','동아고','한경고','북산고'],
    '국어':[40,30,0,100,100,100,100,50],
    'SW특기':['Python','Java','nothing','everything','Manga','Python','Python','C'],
    '영어':[10,5,0,100,100,100,100,3],
    '자녀':[0,0,0,0,2,3,2,0]
}
data

{'이름': ['채치수', '정대만', '신호철', '송진영', '김태권', '김현지', '이상은', '강백호'],
 '학교': ['북산고', '북산고', '시사고', '쿠팡고', '서울고', '동아고', '한경고', '북산고'],
 '국어': [40, 30, 0, 100, 100, 100, 100, 50],
 'SW특기': ['Python',
  'Java',
  'nothing',
  'everything',
  'Manga',
  'Python',
  'Python',
  'C']}

In [2]:
data['이름']

['채치수', '정대만', '신호철', '송진영', '김태권', '김현지', '이상은', '강백호']

In [3]:
data['국어']

[40, 30, 0, 100, 100, 100, 100, 50]

# DataFrame 객체 생성

In [4]:
import pandas as pd
df=pd.DataFrame(data)

In [5]:
df

    이름   학교   국어        SW특기
0  채치수  북산고   40      Python
1  정대만  북산고   30        Java
2  신호철  시사고    0     nothing
3  송진영  쿠팡고  100  everything
4  김태권  서울고  100       Manga
5  김현지  동아고  100      Python
6  이상은  한경고  100      Python
7  강백호  북산고   50           C

# 데이터 접근

In [6]:
df['이름']

0    채치수
1    정대만
2    신호철
3    송진영
4    김태권
5    김현지
6    이상은
7    강백호
Name: 이름, dtype: object

In [7]:
df['국어']

0     40
1     30
2      0
3    100
4    100
5    100
6    100
7     50
Name: 국어, dtype: int64

In [9]:
df[['이름','학교']]

    이름   학교
0  채치수  북산고
1  정대만  북산고
2  신호철  시사고
3  송진영  쿠팡고
4  김태권  서울고
5  김현지  동아고
6  이상은  한경고
7  강백호  북산고

# DataFrame 객체 생성 (Index 지정)

In [12]:
df=pd.DataFrame(data, index=['1번','2번','3번','4번','5번','6번','7번','8번'])
df

     이름   학교   국어        SW특기
1번  채치수  북산고   40      Python
2번  정대만  북산고   30        Java
3번  신호철  시사고    0     nothing
4번  송진영  쿠팡고  100  everything
5번  김태권  서울고  100       Manga
6번  김현지  동아고  100      Python
7번  이상은  한경고  100      Python
8번  강백호  북산고   50           C

## DataFrame 객체 (Column 지정)

In [ ]:
df=pd.DataFrame(data, columns=['이름','ㅎ'])